fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Специалисты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ  Параметры.Свойство("ПутьКДанным") Тогда 
		Возврат;
	КонецЕсли;   
	
	СформироватьДиаграмму(ПолучитьИзВременногоХранилища(Параметры.ПутьКДанным));
КонецПроцедуры
#КонецОбласти  

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура СформироватьДиаграмму(ТаблицаДанных) 
	Если ТаблицаДанных.Количество() <= 0 Тогда
		Возврат;
	КонецЕсли; 
	
	ДиаграммаГанта.Обновление = Ложь;
	ДиаграммаГанта.Очистить();   
	
	СерияОтпуск = ДиаграммаГанта.УстановитьСерию("Отпуск");
	СерияОтпуск.Текст = "Отпуск";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДанных.Сотрудник КАК Сотрудник,
		|	ТаблицаДанных.ДатаНачала КАК ДатаНачала,
		|	ТаблицаДанных.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВтТаблица
		|ИЗ
		|	&ТаблицаДанных КАК ТаблицаДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтТаблица.Сотрудник КАК Сотрудник,
		|	ВтТаблица.ДатаНачала КАК ДатаНачала,
		|	ВтТаблица.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	ВтТаблица КАК ВтТаблица
		|ИТОГИ ПО
		|	Сотрудник";
	
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
	РезультатЗапроса = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);  
	
	Пока РезультатЗапроса.Следующий() Цикл    
		Точка = ДиаграммаГанта.УстановитьТочку(РезультатЗапроса.Сотрудник); 
		Точка.Текст = РезультатЗапроса.Сотрудник.Наименование;
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, СерияОтпуск);

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			Интервал = Значение.Добавить();
			Интервал.Начало = ВыборкаДетальныеЗаписи.ДатаНачала;
			Интервал.Конец = ВыборкаДетальныеЗаписи.ДатаОкончания;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
